# Labirary

In [2]:
import pandas as pd
import numpy as np

***Pandas Datatypes***
1. Series
2. DataFrame

In [3]:
# Series
data=np.arange(10,20)
S1=pd.Series(data)
S1

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [5]:
print(type(S1))

<class 'pandas.core.series.Series'>

In [8]:
S2=pd.Series(
    data=[2300,3400,4500,5600,6700],
    index=['A','B','C','D','E'],
    dtype=float,
    name='Salary'
)
S2

A    2300.0
B    3400.0
C    4500.0
D    5600.0
E    6700.0
Name: Salary, dtype: float64

In [10]:
# DataFrame
df= pd.DataFrame(S2)
df

   Salary
A  2300.0
B  3400.0
C  4500.0
D  5600.0
E  6700.0

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
d1={
    "Name":["Mayank","Satyam","Dexant","Gopal","Uday"],
    "Age":[23,21,13,25,43,],
    "Gender":['M',"M",'M','F','F'],
    'Salary':[34000,42000,32000,43000,56000]   
   }